---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA.LipLength
source: html/160e5e2c-a2a6-f91b-c04a-378034acdc79.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA.LipLength Property

Lip segment length.

## Syntax (C#)
```csharp
public double LipLength { get; set; }
```